#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-06cf90b46cec0ee56]
aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-0ab94ebe75afc3249]
data.aws_ami.amazon_ami: Reading...
aws_cloudwatch_log_group.cw_loggroup: Refreshing state... [id=app-3-log-group]
aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-020e159d59348c82a]
aws_vpc.this: Refreshing state... [id=vpc-0683a210c5776c46b]
data.aws_iam_policy_document.assume_role: Reading...
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
aws_iam_role.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role]
data.aws_iam_policy_document.vpc_flowlog_policy: Reading...
data.aws_iam_policy_document.vpc_flowlog_policy: Read complete after 0s [id=3756711811]
data.aws_ami.amazon_ami: Read complete after 1s [id=ami-07251f912d2a831a3]
aws_iam_role_policy.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role:vpc_flowlog_role]
aws_route_table.private[1]: Refreshing state... [id=rtb-0f3247dc071298ec2]
aws_subnet.private[0]: Refreshing state... [id=subnet-0ba2a1cf87e6e41bf]
aws_route_table.private[2]: Refreshing state... [id=rtb-0571880de93a4c6d5]
aws_internet_gateway.this-igw: Refreshing state... [id=igw-08c96d62b37ad9008]
aws_route_table.private[0]: Refreshing state... [id=rtb-00766c4f9ed860c3c]
aws_subnet.public[0]: Refreshing state... [id=subnet-0be3c8c5ba8b96936]
aws_subnet.public[1]: Refreshing state... [id=subnet-0716aa29c10455643]
aws_subnet.public[2]: Refreshing state... [id=subnet-00256e9b548af1838]
aws_subnet.private[1]: Refreshing state... [id=subnet-01c14b8929c000ce1]
aws_subnet.private[2]: Refreshing state... [id=subnet-026853a3888f20ed3]
aws_flow_log.app1: Refreshing state... [id=fl-003cde9169e8a4fea]
aws_route_table.public: Refreshing state... [id=rtb-04ad6c64fc46d8b9a]
aws_nat_gateway.public[0]: Refreshing state... [id=nat-090926ef26866ce9a]
aws_nat_gateway.public[1]: Refreshing state... [id=nat-02f62e47792653959]
aws_nat_gateway.public[2]: Refreshing state... [id=nat-0978219419d76546b]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0d769374e337350cd]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0853df388f05bacaf]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0aa3f54a63049a810]
aws_route.internet-route: Refreshing state... [id=r-rtb-04ad6c64fc46d8b9a1080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0782a248930f84292]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-097de28176634c3cd]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0eb3870b5f739ab28]
aws_route.private-route[2]: Refreshing state... [id=r-rtb-0571880de93a4c6d51080289494]
aws_route.private-route[0]: Refreshing state... [id=r-rtb-00766c4f9ed860c3c1080289494]
aws_route.private-route[1]: Refreshing state... [id=r-rtb-0f3247dc071298ec21080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_attachment.attach-app will be created
  + resource "aws_autoscaling_attachment" "attach-app" {
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # aws_autoscaling_group.application will be created
  + resource "aws_autoscaling_group" "application" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 3
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + max_size                  = 6
      + metrics_granularity       = "1Minute"
      + min_size                  = 3
      + name                      = "app-one"
      + name_prefix               = (known after apply)
      + predicted_capacity        = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-00256e9b548af1838",
          + "subnet-0716aa29c10455643",
          + "subnet-0be3c8c5ba8b96936",
        ]
      + wait_for_capacity_timeout = "10m"
      + warm_pool_size            = (known after apply)

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "app-3"
        }
    }

  # aws_default_security_group.default will be created
  + resource "aws_default_security_group" "default" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + vpc_id                 = "vpc-0683a210c5776c46b"
    }

  # aws_launch_template.application will be created
  + resource "aws_launch_template" "application" {
      + arn             = (known after apply)
      + default_version = (known after apply)
      + id              = (known after apply)
      + image_id        = "ami-07251f912d2a831a3"
      + instance_type   = "t2.small"
      + latest_version  = (known after apply)
      + name            = (known after apply)
      + name_prefix     = (known after apply)
      + tags_all        = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + user_data       = "IyEvYmluL2Jhc2gKc3VkbyBzdQp5dW0gdXBkYXRlIC15Cnl1bSBpbnN0YWxsIC15IGh0dHBkLng4Nl82NAp5dW0gaW5zdGFsbCAteSBqcQpSRUdJT05fQVZfWk9ORT1gY3VybCAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9keW5hbWljL2luc3RhbmNlLWlkZW50aXR5L2RvY3VtZW50IHwganEgLmF2YWlsYWJpbGl0eVpvbmUgLXJgCnN5c3RlbWN0bCBzdGFydCBodHRwZC5zZXJ2aWNlCnN5c3RlbWN0bCBlbmFibGUgaHR0cGQuc2VydmljZQplY2hvIOKAnEhlbGxvIFdvcmxkIGZyb20gJChob3N0bmFtZSAtZikgZnJvbSB0aGUgYXZhaWxhYmlsaXR5IHpvbmU6ICRSRUdJT05fQVZfWk9OReKAnSA+IC92YXIvd3d3L2h0bWwvaW5kZXguaHRtbA=="

      + network_interfaces {
          + security_groups = (known after apply)
        }
    }

  # aws_lb.front will be created
  + resource "aws_lb" "front" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = false
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "front"
      + preserve_host_header                        = false
      + security_groups                             = (known after apply)
      + subnets                                     = [
          + "subnet-00256e9b548af1838",
          + "subnet-0716aa29c10455643",
          + "subnet-0be3c8c5ba8b96936",
        ]
      + tags                                        = {
          + "Environment" = "Dev"
        }
      + tags_all                                    = {
          + "Environment" = "Dev"
          + "Source"      = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.front_end will be created
  + resource "aws_lb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.front will be created
  + resource "aws_lb_target_group" "front" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "application-front"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0683a210c5776c46b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }
    }

  # aws_route.private-route[0] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-090926ef26866ce9a"
        id                     = "r-rtb-00766c4f9ed860c3c1080289494"
      - nat_gateway_id         = "nat-090926ef26866ce9a" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_route.private-route[1] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-02f62e47792653959"
        id                     = "r-rtb-0f3247dc071298ec21080289494"
      - nat_gateway_id         = "nat-02f62e47792653959" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_route.private-route[2] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-0978219419d76546b"
        id                     = "r-rtb-0571880de93a4c6d51080289494"
      - nat_gateway_id         = "nat-0978219419d76546b" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_security_group.asg_lb_security_group will be created
  + resource "aws_security_group" "asg_lb_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow inbound and outbound traffic to load balancer from the internet."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "ASG-LB-SG-IN"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-1-asg-lb-sg"
        }
      + tags_all               = {
          + "Name"   = "app-1-asg-lb-sg"
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + vpc_id                 = "vpc-0683a210c5776c46b"
    }

  # aws_security_group.ec2_security_group will be created
  + resource "aws_security_group" "ec2_security_group" {
      + arn                    = (known after apply)
      + description            = "Allow inbound and outbound traffic to EC2 instances from load balancer security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "Instance-SG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "app-1-instance-sg"
        }
      + tags_all               = {
          + "Name"   = "app-1-instance-sg"
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + vpc_id                 = "vpc-0683a210c5776c46b"
    }

Plan: 9 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + lb_endpoint = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*